const lastUpdateStr="2023.05.19 , 11:11";
document.getElementById("lastUpdate").innerHTML = lastUpdateStr;

// = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = = //

const dataArr = [
			// under-tree , about family 
/*000*/{ eng:"Mazzawi Family" , ar:"آل مزاوي" , path:"./res/about_family.png" , shape:"rect" , coords:"4,1349,999,1464", 
			smap:[{i:0,c_en:"",c_ar:""} /* << dummy */,{i:1,c_en:"427,77,747,113",c_ar:"543,102,362,142"},{i:1,c_en:"1132,94,1317,143",c_ar:"543,102,362,142"}] },
			
// * * * * * * * * * * * * * * *  // Branches section / polygons // * * * * * * * * * * * * * * *  //
/*001*/{ eng:"Ibrahim Al-Doumany (Mazzawi)" , ar:"ابراهيم الدوماني (مزاوي)" , path:"./branches/IbrahimDoumanyMazzawi.png" , shape:"poly" , 
			coords:"392,1158,478,1153,527,1151,571,1150,573,1171,578,1206,588,1247,602,1271,617,1278,627,1286,637,1286,671,1291,700,1296,748,1303,776,1313,819,1326,795,1338,740,1343,703,1342,588,1342,480,1345,392,1346,345,1345,259,1346,233,1327,273,1320,332,1307,368,1297,391,1279,399,1255,401,1211,394,1175" , 
			smap:[{i:0,c_en:"1166,4,1010,48",c_ar:"940,4,1094,51",p:"O"},{i:23,c_en:"707,83,539,135",c_ar:"485,83,620,141"},{i:2,c_en:"1471,83,1600,132",c_ar:"1297,77,1438,139"},
				{i:54,c_en:"130,197,288,239",c_ar:"86,195,227,242",p:"grandson"},{i:55,c_en:"221,246,395,288",c_ar:"163,248,300,293",p:"great_grandson"},{i:69,c_en:"68,251,189,298",c_ar:"137,257,43,301",p:"great_grandson"},
				{i:33,c_en:"553,194,722,239",c_ar:"492,199,631,246",p:"grandson"},{i:40,c_en:"643,249,893,301",c_ar:"599,257,819,299",p:"great_grandson"},{i:34,c_en:"603,288,425,328",c_ar:"518,286,391,331",p:"great_grandson"},
				{i:24,c_en:"1029,204,1183,249",c_ar:"932,207,1032,252",p:"grandson"},{i:25,c_en:"1111,301,1238,345",c_ar:"1005,301,1092,346",p:"great_grandson"},{i:30,c_en:"1079,298,903,343",c_ar:"962,304,840,348",p:"great_grandson"},
				{i:3,c_en:"1557,275,1684,322",c_ar:"1393,274,1485,321",p:"grandson"},{i:9,c_en:"1525,260,1394,309",c_ar:"1363,227,1269,267",p:"grandson"}] },
/*002*/{ eng:"Moussa Ibrahim" , ar:"موسى ابراهيم" , path:"./branches/MoussaIbrahim.png" , shape:"poly" , 
			coords:"574,1145,575,1127,573,1108,584,1077,592,1055,613,1022,603,1009,593,994,576,987,566,1002,554,1023,546,1041,532,1069,522,1100,516,1123,511,1139,510,1146" , 
			smap:[{i:1,c_en:"300,9,437,61",c_ar:"296,6,410,56",p:"father"},{i:9,c_en:"153,132,286,178",c_ar:"290,128,187,176"},{i:3,c_en:"379,194,508,251",c_ar:"377,194,473,249"}] },
/*003*/{ eng:"Yousef Moussa Ibrahim" , ar:"يوسف موسى ابراهيم" , path:"./branches/YousefMoussaIbrahim.png" , shape:"poly" , 
			coords:"602,1001,610,994,620,981,628,971,642,956,652,952,663,949,675,943,692,938,696,919,678,922,659,928,644,935,628,941,616,957,606,969,599,985,590,990" ,
			smap:[{i:2,c_en:"262,23,405,86",c_ar:"217,31,324,84",p:"father"},{i:6,c_en:"125,117,285,169",c_ar:"69,115,217,163"},{i:4,c_en:"384,96,567,149",c_ar:"317,90,449,134"}] },
/*004*/{ eng:"Elias Yousef Moussa Ibrahim" , ar:"الياس يوسف موسى ابراهيم" , path:"./branches/EliasYousefMoussaIbrahim.png" , shape:"poly" , 
			coords:"693,936,697,929,708,929,722,933,737,943,751,953,765,960,780,963,784,970,770,970,755,963,737,957,721,953,701,946" ,
			smap:[{i:3,c_en:"0,3,175,57",c_ar:"125,45,0,3",p:"father"},{i:5,c_en:"69,177,210,229",c_ar:"68,182,176,227"}]  },
/*005*/{ eng:"Boulos Elias Yousef Moussa" , ar:"بولس الياس يوسف موسى" , path:"./branches/BoulosEliasYousefMoussa.png" , shape:"poly" , 
			coords:"788,973,783,962,812,963,829,966,838,968,843,973,832,979,824,982,810,980,797,977" , 
			smap:[{i:4,c_en:"122,50,0,3",c_ar:"3,2,116,48",p:"father"}]  },
/*006*/{ eng:"Moussa Yousef Moussa Ibrahim" , ar:"موسى يوسف موسى ابراهيم" , path:"./branches/MoussaYousefMoussaIbrahim.png" , shape:"poly" , 
			coords:"694,927,699,916,711,907,732,900,741,896,762,886,796,880,794,892,773,897,751,909,732,918,720,928,707,927" ,
			smap:[{i:3,c_en:"233,4,391,63",c_ar:"150,12,310,60",p:"father"},{i:8,c_en:"220,328,82,370",c_ar:"167,323,25,370"},{i:7,c_en:"317,68,476,118",c_ar:"266,71,382,116"}]  },
/*007*/{ eng:"Tawfik Moussa Yousef Moussa" , ar:"توفيق موسى يوسف موسى" , path:"./branches/TawfikMoussaYousefMoussa.png" , shape:"poly" , 
			coords:"797,889,812,882,826,882,842,883,854,889,866,900,850,904,836,904,822,903,807,894" ,
			smap:[{i:6,c_en:"277,5,440,44",c_ar:"276,3,392,46",p:"father"},{i:112,c_en:"358,116,479,159",c_ar:"358,119,448,160"},{i:113,c_en:"274,80,121,117",c_ar:"268,77,137,117"},
				{i:114,c_en:"352,317,489,363",c_ar:"352,327,490,370"}]},
/*008*/{ eng:"Elias Moussa Yousef Moussa" , ar:"الياس موسى يوسف موسى" , path:"./branches/EliasMoussaYousefMoussa.png" , shape:"poly" , 
			coords:"797,883,812,879,822,871,835,861,846,855,859,850,871,840,884,820,867,821,856,826,838,838,826,850,815,859,804,872" ,
			smap:[{i:6,c_en:"136,50,0,1",c_ar:"127,45,0,0",p:"father"},{i:115,c_en:"74,172,200,225",c_ar:"72,173,210,222"}]  },
/*009*/{ eng:"Dahoud Moussa Ibrahim" , ar:"داود موسى ابراهيم" , path:"./branches/DahoudMoussaIbrahim.png" , shape:"poly" , 
			coords:"665,866,679,867,685,876,672,888,654,905,641,920,633,932,620,943,613,951,600,969,595,981,588,989,576,982,582,971,592,951,602,934,614,918,628,899,640,892,652,877",
			smap:[{i:2,c_en:"248,6,392,55",c_ar:"245,8,345,51",p:"father"},{i:10,c_en:"337,61,509,111",c_ar:"330,60,455,108"},{i:16,c_en:"336,393,480,446",c_ar:"335,397,434,448"},
				{i:18,c_en:"257,60,84,102",c_ar:"259,60,139,103"},{i:20,c_en:"240,258,114,301",c_ar:"249,259,156,299"},{i:22,c_en:"256,395,71,436",c_ar:"245,389,118,434"}] },
/*010*/{ eng:"Sleiman Dahoud Moussa Ibrahim" , ar:"سليمان داود موسى ابراهيم" , path:"./branches/SleimanDahoudMoussaIbrahim.png" , shape:"poly" , 
			coords:"696,864,701,852,713,838,721,834,731,831,749,824,765,816,773,807,781,814,756,830,738,837,727,850,718,862,707,865" ,
			smap:[{i:9,c_en:"249,4,439,63",c_ar:"349,13,211,61",p:"father"},{i:11,c_en:"333,70,494,120",c_ar:"299,68,421,115"},{i:14,c_en:"243,336,88,377",c_ar:"213,333,84,377"},
				{i:15,c_en:"240,155,116,183",c_ar:"209,154,108,182"},{i:13,c_en:"334,337,516,386",c_ar:"302,337,422,386"}] },
/*011*/{ eng:"Elias Sleiman Dahoud Moussa" , ar:"الياس سليمان داود موسى" , path:"./branches/EliasSleimanDahoudMoussa.png" , shape:"poly" , 
			coords:"791,797,800,792,811,769,814,756,821,745,821,722,812,677,817,634,807,649,808,694,811,719,798,746,797,766,793,782" ,
			smap:[{i:10,c_en:"6,11,162,70",c_ar:"0,3,122,61",p:"father"},{i:12,c_en:"80,305,201,357",c_ar:"79,303,178,353"}] },
/*012*/{ eng:"Nimer Elias Sleiman Dahoud" , ar:"نمر الياس سليمان داود" , path:"./branches/NimerEliasSleimanDahoud.png" , shape:"poly" , 
			coords:"810,636,821,626,829,609,836,607,842,601,847,586,859,574,849,570,838,574,825,583,821,593,818,600,811,611,810,622" , 
			smap:[{i:11,c_en:"354,62,212,12",c_ar:"223,15,340,61",p:"father"},{i:117,c_en:"102,83,274,125",c_ar:"221,76,86,124"},{i:116,c_en:"332,72,466,111",c_ar:"332,67,453,111"}] },
/*013*/{ eng:"Abdou Sleiman Dahoud Moussa" , ar:"عبده سليمان داود موسى" , path:"./branches/AbdouSleimanDahoudMoussa.png" , shape:"poly" , 
			coords:"759,827,776,819,787,817,803,823,790,824,796,833,787,838,774,837" ,
			smap:[{i:10,c_en:"35,37,218,89",c_ar:"45,40,165,85",p:"father"}] },
/*014*/{ eng:"Dahoud Sleiman Dahoud Moussa" , ar:"داود سليمان داود موسى" , path:"./branches/DahoudSleimanDahoudMoussa.png" , shape:"poly" , 
			coords:"793,796,804,792,818,771,833,740,833,720,842,696,869,660,867,673,850,699,850,709,846,722,845,737,838,748,831,765,822,778,812,795" ,
			smap:[{i:10,c_en:"279,10,434,62",c_ar:"291,6,436,54",p:"father"},{i:118,c_en:"400,91,559,142",c_ar:"398,91,519,136"},{i:119,c_en:"402,360,558,404",c_ar:"402,358,517,402"},
				{i:120,c_en:"341,132,151,180",c_ar:"344,132,207,179"},{i:41,c_en:"309,69,189,98",c_ar:"312,65,231,98",p:"daughter",pXtra:[{en:"Warda",ar:"ورده"}]}] },
/*015*/{ eng:"Gerges Sleiman Dahoud Moussa" , ar:"جرجس سليمان داود موسى" , path:"./branches/GergesSleimanDahoudMoussa.png" , shape:"poly" , 
			coords:"798,802,808,798,815,798,821,793,829,782,846,774,862,765,874,757,871,767,863,775,852,789,839,798,824,805,810,805" ,
			smap:[{i:10,c_en:"0,0,120,35",c_ar:"0,0,100,35",p:"father"}] },
/*016*/{ eng:"Yousef Dahoud Moussa Ibrahim" , ar:"يوسف داود موسى ابراهيم" , path:"./branches/YousefDahoudMoussaIbrahim.png" , shape:"poly" , 
			coords:"696,854,706,843,715,834,721,823,724,809,727,798,737,770,727,777,721,788,714,813,708,828" ,
			smap:[{i:9,c_en:"147,52,0,1",c_ar:"1,1,119,49",p:"father"},{i:17,c_en:"74,112,257,162",c_ar:"75,113,204,157"}]  },
/*017*/{ eng:"Salim Yousef Dahoud Moussa" , ar:"سليم يوسف داود موسى" , path:"./branches/SalimYousefDahoudMoussa.png" , shape:"poly" , 
			coords:"727,770,741,765,752,760,755,750,763,733,748,737,735,754" , 
			smap:[{i:16,c_en:"179,49,0,1",c_ar:"122,42,0,1",p:"father"},{i:121,c_en:"74,58,209,107",c_ar:"70,59,163,103"}]  },
/*018*/{ eng:"Ibrahim Dahoud Moussa Ibrahim" , ar:"ابراهيم داود موسى ابراهيم" , path:"./branches/IbrahimDahoudMoussaIbrahim.png" , shape:"poly" , 
			coords:"696,848,703,829,710,814,714,800,715,787,715,765,724,734,717,742,711,754,704,775,700,791,699,812",
			smap:[{i:9,c_en:"203,17,381,76",c_ar:"163,9,281,56",p:"father"},{i:19,c_en:"224,100,52,152",c_ar:"168,79,38,136"}]  },
/*019*/{ eng:"Jeryes Ibrahim Dahoud Moussa" , ar:"جريس ابراهيم داود موسى" , path:"./branches/JeryesIbrahimDahoudMoussa.png" , shape:"poly" , 
			coords:"725,734,722,722,728,702,729,687,724,675,731,666,735,675,737,688,737,701,742,712,739,720,734,729",
			smap:[{i:18,c_en:"288,3,475,59",c_ar:"213,2,349,45",p:"father"},{i:122,c_en:"368,101,507,155",c_ar:"310,93,445,141"},{i:123,c_en:"302,97,133,144",c_ar:"220,90,93,131"}] },
/*020*/{ eng:"Iseed Dahoud Moussa Ibrahim" , ar:"اسعيد داود موسى ابراهيم" , path:"./branches/IseedDahoudMoussaIbrahim.png" , shape:"poly" , 	
			coords:"693,842,696,818,696,786,696,762,694,742,689,720,687,697,686,675,683,707,686,731,687,755,689,775,686,793,686,810,690,828",
			smap:[{i:9,c_en:"6,8,126,61",c_ar:"96,58,2,8",p:"father"},{i:21,c_en:"89,67,282,119",c_ar:"86,67,208,112"}] },
/*021*/{ eng:"Jarmas Iseed Dahoud Moussa" , ar:"جرمس اسعيد داود موسى" , path:"./branches/JarmasIseedDahoudMoussa.png" , shape:"poly" , 
			coords:"682,675,689,670,694,661,694,642,694,625,703,604,708,590,721,576,748,569,735,562,721,566,710,574,700,587,689,607,682,625,680,638,676,656,678,664",
			smap:[{i:20,c_en:"443,0,643,40",c_ar:"416,1,561,42",p:"father"},{i:124,c_en:"768,46,945,94",c_ar:"690,51,809,99"},{i:125,c_en:"390,407,119,458",c_ar:"59,458,284,409"},
				{i:126,c_en:"347,46,202,88",c_ar:"163,98,279,50"}]  },
/*022*/{ eng:"Khalil Dahoud Moussa Ibrahim" , ar:"خليل داود موسى ابراهيم" , path:"./branches/KhalilDahoudMoussaIbrahim.png" , shape:"poly" , 
			coords:"685,849,686,832,675,821,668,798,668,776,658,776,658,789,662,807,666,818,669,828,663,841,673,849,683,862" ,
			smap: [{i:9,c_en:"170,52,0,0",c_ar:"128,49,0,0",p:"father"}] },
/*023*/{ eng:"Khalil Ibrahim" , ar:"خليل ابراهيم" , path:"./branches/KhalilIbrahim.png" , shape:"poly" , 
			coords:"498,1145,495,1131,491,1117,490,1101,494,1084,498,1075,486,1072,472,1071,458,1070,451,1073,435,1074,418,1079,410,1077,397,1080,379,1080,370,1084,354,1091,348,1100,351,1106,361,1115,370,1128,379,1137,385,1144,389,1152",
			smap:[{i:1,c_en:"707,0,539,52",c_ar:"565,0,680,54",p:"father"},
				{i:54,c_en:"130,114,288,156",c_ar:"146,109,270,154"},{i:55,c_en:"221,163,395,205",c_ar:"218,160,355,205",p:"grandson"},{i:69,c_en:"68,168,189,215",c_ar:"100,168,189,215",p:"grandson"},
				{i:33,c_en:"553,111,722,156",c_ar:"575,111,682,156"},{i:40,c_en:"643,166,893,218",c_ar:"663,166,875,208",p:"grandson"},{i:34,c_en:"603,205,425,245",c_ar:"588,200,480,245",p:"grandson"},
				{i:24,c_en:"1029,121,1183,166",c_ar:"1039,121,1144,162"},{i:25,c_en:"1111,218,1238,262",c_ar:"1117,215,1200,257",p:"grandson"},{i:30,c_en:"1079,215,903,260",c_ar:"1074,215,953,255",p:"grandson"}]  },
/*024*/{ eng:"Nasser Khalil Ibrahim" , ar:"ناصر خليل ابراهيم" , path:"./branches/NasserKhalilIbrahim.png" , shape:"poly" , 
			coords:"498,1071,506,1058,519,1044,530,1020,534,1002,538,988,540,971,531,957,516,954,509,960,501,968,495,993,488,1007,477,1021,472,1028,461,1038,450,1041,463,1054,470,1066",
			smap:[{i:23,c_en:"194,9,354,65",c_ar:"223,18,334,62",p:"father"},{i:25,c_en:"323,123,439,172",c_ar:"323,123,409,168"},{i:30,c_en:"72,119,238,175",c_ar:"204,126,80,172"}] },
/*025*/{ eng:"Khalil Nasser Khalil Ibrahim" , ar:"خليل ناصر خليل ابراهيم" , path:"./branches/KhalilNasserKhalilIbrahim.png" , shape:"poly" , 
			coords:"524,948,529,934,533,918,538,910,534,889,537,861,548,828,554,815,544,797,534,821,529,835,529,849,523,857,517,877,512,887,508,903,512,912,512,925,509,941,506,957",
			smap:[{i:24,c_en:"550,6,675,61",c_ar:"408,10,508,60",p:"father"},{i:26,c_en:"630,105,767,156",c_ar:"500,107,591,151"},{i:27,c_en:"223,91,442,143",c_ar:"98,96,260,146"}] },
/*026*/{ eng:"Abdullah Khalil Nasser Khalil" , ar:"عبدالله خليل ناصر خليل" , path:"./branches/AbdullahKhalilNasserKhalil.png" , shape:"poly" , 
			coords:"541,786,551,799,550,775,550,751,548,729,543,694,534,695,534,723,531,743,536,768",
			smap:[{i:25,c_en:"50,30,180,88",c_ar:"45,45,130,88",p:"father"}] },
/*027*/{ eng:"Abdou Khalil Nasser Khalil" , ar:"عبده خليل ناصر خليل" , path:"./branches/AbdouKhalilNasserKhalil.png" , shape:"poly" , 
			coords:"550,805,551,771,551,751,561,734,568,701,582,699,578,712,569,746,569,760,568,786,557,813",
			smap:[{i:25,c_en:"215,9,435,61",c_ar:"157,10,323,60",p:"father"},{i:28,c_en:"295,67,475,117",c_ar:"293,68,404,116"},{i:29,c_en:"206,108,83,158",c_ar:"206,113,124,157"}] },
/*028*/{ eng:"Khalil Abdou Khalil Nasser" , ar:"خليل عبده خليل ناصر" , path:"./branches/KhalilAbdouKhalilNasser.png" , shape:"poly" , 
			coords:"576,696,583,695,588,684,595,678,604,673,607,653,609,638,607,621,607,602,612,591,602,593,602,611,597,633,585,663,582,673,579,685",
			smap:[{i:27,c_en:"270,2,462,53",c_ar:"241,4,362,47",p:"father"},{i:107,c_en:"154,567,316,607",c_ar:"243,554,119,603"},{i:106,c_en:"315,204,157,246",c_ar:"240,194,140,240"},
				{i:105,c_en:"404,221,531,262",c_ar:"336,206,434,255"}] },
/*029*/{ eng:"Moeen Abdou Khalil Nasser" , ar:"معين عبده خليل ناصر" , path:"./branches/MoeenAbdouKhalilNasser.png" , shape:"poly" , 
			coords:"565,694,574,691,575,675,575,667,575,657,569,645,568,625,565,615,561,630,560,647,557,660,557,675,562,684",
			smap:[{i:27,c_en:"120,54,0,0",c_ar:"0,0,120,50",p:"father"},{i:108,c_en:"210,110,75,60",c_ar:"200,110,75,56"}]},
/*030*/{ eng:"Hanna Nasser Khalil Ibrahim" , ar:"حنا ناصر خليل ابراهيم" , path:"./branches/HannaNasserKhalilIbrahim.png" , shape:"poly" , 
			coords:"536,958,541,937,541,919,547,896,568,857,585,819,599,784,602,801,599,822,582,853,575,870,568,884,564,891,567,903,568,915,560,927,548,946",
			smap:[{i:24,c_en:"414,60,244,8",c_ar:"226,5,354,58",p:"father"},{i:31,c_en:"320,105,463,157",c_ar:"319,100,406,157"},{i:32,c_en:"227,83,91,139",c_ar:"227,81,140,136"}] },
/*031*/{ eng:"Ameen Hanna Nasser Khalil" , ar:"أمين حنا ناصر خليل" , path:"./branches/AmeenHannaNasserKhalil.png" , shape:"poly" , 
			coords:"603,774,607,757,613,744,624,725,631,713,634,698,631,675,624,682,616,692,609,706,604,716,603,730,602,741",
			smap:[{i:30,c_en:"468,1,622,53",c_ar:"502,5,594,51",p:"father"},{i:109,c_en:"157,82,347,138",c_ar:"184,84,322,138"},{i:110,c_en:"579,170,696,222",c_ar:"577,169,680,222"}] },
/*032*/{ eng:"Jameel Hanna Nasser Khalil" , ar:"جميل حنا ناصر خليل" , path:"./branches/JameelHannaNasserKhalil.png" , shape:"poly" , 
			coords:"604,771,610,758,616,744,624,729,634,718,649,715,648,726,644,737,637,747,623,760,613,770",
			smap:[{i:30,c_en:"0,0,128,51",c_ar:"0,5,78,51",p:"father"},{i:111,c_en:"70,96,221,147",c_ar:"70,97,195,147"}] },
/*033*/{ eng:"Sleiman Khalil Ibrahim" , ar:"سليمان خليل ابراهيم" , path:"./branches/SleimanKhalilIbrahim.png" , shape:"poly" , 
			coords:"451,1061,442,1040,435,1014,437,988,432,943,440,889,454,859,472,830,464,815,444,818,430,830,418,844,409,863,397,898,392,925,390,948,395,985,397,1012,399,1030,413,1052,416,1062,428,1069",
			smap:[{i:23,c_en:"219,10,382,54",c_ar:"230,7,367,54",p:"father"},{i:34,c_en:"71,145,247,100",c_ar:"244,100,123,145"},{i:40,c_en:"341,62,592,115",c_ar:"340,64,549,114"}] },
/*034*/{ eng:"Yousef Sleiman Khalil Ibrahim" , ar:"يوسف سليمان خليل ابراهيم" , path:"./branches/YousefSleimanKhalilIbrahim.png" , shape:"poly" , 
			coords:"464,811,439,811,447,794,450,771,453,746,450,724,446,704,464,701,472,705,478,746,475,764,474,788",
			smap:[{i:33,c_en:"831,37,639,0",c_ar:"588,0,717,40",p:"father"},{i:35,c_en:"731,125,866,172",c_ar:"696,123,784,169"},{i:36,c_en:"240,67,434,113",c_ar:"231,67,364,115"},
				{i:38,c_en:"732,265,965,319",c_ar:"696,265,856,311"}] },
/*035*/{ eng:"Niemeh Yousef Sleiman Khalil" , ar:"نعمه يوسف سليمان خليل" , path:"./branches/NiemehYousefSleimanKhalil.png" , shape:"poly" , 
			coords:"460,697,456,679,454,659,458,645,467,639,467,651,465,662,463,676,467,694",
			smap:[{i:34,c_en:"0,0,125,52",c_ar:"0,0,110,52",p:"father"}] },
/*036*/{ eng:"Mineem Yousef Sleiman Khalil" , ar:"منعم يوسف سليمان خليل" , path:"./branches/MineemYousefSleimanKhalil.png" , shape:"poly" , 
			coords:"456,689,451,656,456,637,463,611,465,589,465,572,451,576,454,597,451,623,446,642,442,658,444,673,446,683,453,698",
			smap:[{i:34,c_en:"253,2,451,46",c_ar:"242,1,369,45",p:"father"},{i:37,c_en:"389,53,510,94",c_ar:"353,57,455,97"},{i:103,c_en:"390,343,516,383",c_ar:"352,337,440,380"},
				{i:104,c_en:"176,168,298,216",c_ar:"151,169,253,217"}] },
/*037*/{ eng:"Yousef Mineem Yousef Sleiman" , ar:"يوسف منعم يوسف سليمان" , path:"./branches/YousefMineemYousefSleiman.png" , shape:"poly" , 
			coords:"453,564,468,560,467,546,467,532,461,515,451,507,442,498,442,484,436,475,433,486,436,511,444,532,446,548",
			smap:[{i:36,c_en:"0,0,125,51",c_ar:"0,0,111,51",p:"father"}] },
/*038*/{ eng:"Naoum Yousef Sleiman Khalil" , ar:"نعوم يوسف سليمان خليل" , path:"./branches/NaoumYousefSleimanKhalil.png" , shape:"poly" , 
			coords:"443,696,444,679,430,645,419,618,405,582,399,550,385,537,392,565,401,600,409,627,416,648,432,684",
			smap:[{i:34,c_en:"1,3,134,29",c_ar:"8,2,79,22",p:"father"},{i:39,c_en:"77,333,205,382",c_ar:"77,335,165,380"},{i:40,c_en:"65,33,236,55",c_ar:"8,43,112,22",p:"father_in_law"},
				{i:48,c_en:"77,505,205,535",c_ar:"77,500,165,530",p:"daughter",pXtra:[{en:"Marcelle",ar:"مارسيل"}]},{i:49,c_en:"77,135,225,165",c_ar:"77,130,185,160",p:"daughter",pXtra:[{en:"Marguerite",ar:"مرغريت"}]}] },
/*039*/{ eng:"George Naoum Yousef Sleiman" , ar:"جورج نعوم يوسف سليمان" , path:"./branches/GeorgeNaoumYousefSleiman.png" , shape:"poly" , 
			coords:"395,538,383,527,378,510,371,494,369,479,371,462,371,444,384,434,385,452,388,465,391,475,390,484,392,497,392,513",
			smap:[{i:38,c_en:"0,0,125,52",c_ar:"0,0,80,44",p:"father"}] },
/*040*/{ eng:"Asaad Sleiman Khalil Ibrahim" , ar:"أسعد سليمان خليل ابراهيم" , path:"./branches/AsaadSleimanKhalilIbrahim.png" , shape:"poly" , 
			coords:"485,811,473,801,476,783,483,749,478,732,483,703,488,670,503,639,510,607,527,566,531,550,551,548,561,562,544,595,525,639,512,679,506,705,506,727,506,743,501,763,498,788",
			smap:[{i:33,c_en:"180,4,462,47",c_ar:"214,2,430,51",p:"father"},{i:38,c_en:"135,368,257,390",c_ar:"190,368,259,389",p:"daughter",pXtra:[{en:"Thouria",ar:"ثريا"}]},{i:42,c_en:"364,54,696,93",c_ar:"365,59,629,101"},
				{i:50,c_en:"291,76,114,121",c_ar:"174,75,293,123"},{i:46,c_en:"367,375,639,417",c_ar:"365,374,601,420"},{i:41,c_en:"291,400,100,441",c_ar:"262,398,153,444"}] },
/*041*/{ eng:"Iskandar Asaad Sleiman Khalil" , ar:"اسكندر أسعد سليمان خليل" , path:"./branches/IskandarAsaadSleimanKhalil.png" , shape:"poly" , 
			coords:"480,425,486,423,491,427,492,436,496,443,500,454,506,459,511,464,515,473,520,479,524,489,530,494,537,502,539,509,541,526,541,533,530,522,513,505,508,490,508,478,498,470,492,455,487,441,482,431" , 
			smap:[{i:40,c_en:"25,1,163,26",c_ar:"24,2,121,28",p:"father"},{i:72,c_en:"68,138,192,164",c_ar:"65,140,137,162"},{i:14,c_en:"93,34,212,59",c_ar:"43,31,106,57",p:"father_in_law"}]  },
/*042*/{ eng:"Mikhaeel Asaad Sleiman Khalil" , ar:"مخائيل أسعد سليمان خليل" , path:"./branches/MikhaeelAsaadSleimanKhalil.png" , shape:"poly" , 
			coords:"562,544,565,526,571,513,585,502,621,491,645,477,647,489,631,495,612,502,603,507,589,519,581,531,572,540",
			smap:[{i:40,c_en:"91,3,430,51",c_ar:"74,0,336,52",p:"father"},{i:73,c_en:"240,373,50,412",c_ar:"149,369,21,413"},{i:43,c_en:"301,99,447,140",c_ar:"245,99,348,140"},
				{i:44,c_en:"300,315,453,354",c_ar:"245,314,364,352"},{i:45,c_en:"242,71,65,108",c_ar:"149,65,21,108"}] },
/*043*/{ eng:"Keysar Mikhaeel Asaad Sleiman" , ar:"قيصر مخائيل أسعد سليمان" , path:"./branches/KeysarMikhaeelAsaadSleiman.png" , shape:"poly" , 
			coords:"647,484,659,483,671,477,686,468,700,462,713,463,721,463,731,468,746,472,721,473,707,476,700,483,690,489,680,491,666,490,652,490",
			smap:[{i:42,c_en:"470,5,631,58",c_ar:"433,6,586,56",p:"father"},{i:79,c_en:"181,346,351,396",c_ar:"183,347,305,393"},{i:77,c_en:"492,343,663,384",c_ar:"455,343,569,388"},
				{i:78,c_en:"180,14,365,66",c_ar:"168,16,302,65"},{i:74,c_en:"785,8,934,50",c_ar:"751,6,850,49"},{i:75,c_en:"793,375,980,418",c_ar:"758,375,910,419"},
				{i:76,c_en:"492,91,617,138",c_ar:"454,88,592,134"}] },
/*044*/{ eng:"Asaad Mikhaeel Asaad Sleiman" , ar:"أسعد مخائيل أسعد سليمان" , path:"./branches/AsaadMikhaeelAsaadSleiman.png" , shape:"poly" , 
			coords:"649,482,661,479,678,465,693,451,707,438,718,428,731,423,737,411,721,414,704,425,689,435,676,451,665,463",
			smap:[{i:42,c_en:"0,0,155,50",c_ar:"0,0,130,49",p:"father"},{i:80,c_en:"75,173,250,223",c_ar:"75,173,200,223"}] },
/*045*/{ eng:"Wasef Mikhaeel Asaad Sleiman" , ar:"واصف مخائيل أسعد سليمان" , path:"./branches/WasefMikhaeelAsaadSleiman.png" , shape:"poly" , 
			coords:"647,479,661,461,668,451,678,440,685,425,694,403,707,382,689,390,679,406,665,420,656,434,652,449,651,463",
			smap:[{i:42,c_en:"0,0,175,50",c_ar:"0,0,130,49",p:"father"},{i:81,c_en:"75,173,230,225",c_ar:"75,173,200,223"}] },
/*046*/{ eng:"Salim Asaad Sleiman Khalil" , ar:"سليم أسعد سليمان خليل" , path:"./branches/SalimAsaadSleimanKhalil.png" , shape:"poly" , 
			coords:"546,534,541,500,537,485,530,468,531,449,522,427,516,399,515,384,515,370,526,361,526,388,533,404,538,423,544,439,548,454,554,468,553,485,551,502,551,515",
			smap:[{i:40,c_en:"182,25,463,70",c_ar:"172,21,413,72",p:"father"},{i:93,c_en:"54,118,291,157",c_ar:"35,117,273,158"},{i:48,c_en:"349,303,536,341",c_ar:"335,300,466,343"},
				{i:47,c_en:"354,102,475,140",c_ar:"336,103,420,140"},{i:49,c_en:"76,227,283,268",c_ar:"240,227,101,273"}] },
/*047*/{ eng:"Naeem Salim Asaad Sleiman" , ar:"نعيم سليم أسعد سليمان" , path:"./branches/NaeemSalimAsaadSleiman.png" , shape:"poly" , 
			coords:"523,365,524,337,529,320,526,308,516,296,506,289,491,274,479,258,489,285,498,308,506,323,512,333",
			smap:[{i:46,c_en:"283,14,425,65",c_ar:"268,15,361,64",p:"father"},{i:94,c_en:"370,151,486,201",c_ar:"349,152,454,198"},{i:95,c_en:"119,85,276,130",c_ar:"248,85,129,130"},
				{i:96,c_en:"294,378,112,421",c_ar:"250,378,116,421"}] },
/*048*/{ eng:"Elia Salim Asaad Sleiman" , ar:"ايليا سليم أسعد سليمان" , path:"./branches/EliaSalimAsaadSleiman.png" , shape:"poly" , 
			coords:"526,358,524,347,527,334,530,323,533,313,527,301,529,292,531,279,534,271,534,261,536,240,538,251,543,261,543,270,544,279,546,291,547,301,538,317,537,327,531,341",
			smap:[{i:46,c_en:"210,6,397,29",c_ar:"237,6,371,29",p:"father"},{i:38,c_en:"280,48,397,29",c_ar:"308,50,236,29",p:"father_in_law"},{i:97,c_en:"348,136,454,183",c_ar:"343,132,450,177"},
				{i:98,c_en:"347,310,486,357",c_ar:"342,306,452,353"},{i:99,c_en:"99,109,271,153",c_ar:"161,106,277,152"},{i:100,c_en:"120,208,251,252",c_ar:"148,205,259,252"}] },
/*049*/{ eng:"George Salim Asaad Sleiman" , ar:"جورج سليم أسعد سليمان" , path:"./branches/GeorgeSalimAsaadSleiman.png" , shape:"poly" , 
			coords:"519,361,513,344,502,327,487,320,472,319,460,319,453,327,470,329,479,333,487,336,501,344",
			smap:[{i:46,c_en:"200,25,0,0",c_ar:"115,22,0,2",p:"father"},{i:38,c_en:"200,50,87,27",c_ar:"62,45,0,22",p:"father_in_law"},{i:101,c_en:"76,57,199,105",c_ar:"75,55,182,100"},
				{i:102,c_en:"75,191,221,240",c_ar:"75,187,197,238"}] },
/*050*/{ eng:"Sleiman Asaad Sleiman Khalil" , ar:"سليمان أسعد سليمان خليل" , path:"./branches/SleimanAsaadSleimanKhalil.png" , shape:"poly" , 
			coords:"560,540,568,510,578,467,590,434,606,419,583,415,576,434,569,451,562,468,557,485,555,507,551,523,550,541",
			smap:[{i:40,c_en:"185,2,365,44",c_ar:"164,0,284,46",p:"father"},{i:53,c_en:"120,554,456,593",c_ar:"89,549,358,595"},{i:52,c_en:"322,325,535,363",c_ar:"271,325,419,364"},
				{i:51,c_en:"320,53,480,92",c_ar:"271,49,400,91"},{i:84,c_en:"71,359,255,402",c_ar:"175,355,41,399"},{i:82,c_en:"90,84,255,118",c_ar:"174,84,58,123"},
				{i:83,c_en:"92,227,250,262",c_ar:"87,228,177,267"}] },
/*051*/{ eng:"Tawfik Sleiman Asaad Sleiman" , ar:"توفيق سليمان أسعد سليمان" , path:"./branches/TawfikSleimanAsaadSleiman.png" , shape:"poly" , 
			coords:"589,413,592,400,596,386,600,365,606,347,610,336,612,312,610,282,610,268,602,292,593,315,588,337,590,350,588,372,588,392",
			smap:[{i:50,c_en:"391,4,559,46",c_ar:"336,4,474,48",p:"father"},{i:86,c_en:"473,269,662,310",c_ar:"442,272,561,314"},{i:88,c_en:"391,61,231,106",c_ar:"337,63,217,103"},
				{i:89,c_en:"240,363,377,409",c_ar:"336,366,218,409"},{i:87,c_en:"473,392,629,433",c_ar:"442,399,553,444"},{i:85,c_en:"473,53,637,94",c_ar:"436,53,556,95"}] },
/*052*/{ eng:"Elias Sleiman Asaad Sleiman" , ar:"الياس سليمان أسعد سليمان" , path:"./branches/EliasSleimanAsaadSleiman.png" , shape:"poly" , 
			coords:"593,413,602,392,607,374,613,351,621,340,630,324,633,334,634,344,633,354,623,364,616,376,604,406",
			smap:[{i:50,c_en:"191,0,409,44",c_ar:"186,0,374,44",p:"father"},{i:90,c_en:"323,49,487,98",c_ar:"322,52,431,95"}] },
/*053*/{ eng:"Raja Sleiman Asaad Sleiman" , ar:"رجا سليمان أسعد سليمان" , path:"./branches/RajaSleimanAsaadSleiman.png" , shape:"poly" , 
			coords:"599,411,610,399,621,381,634,362,642,355,658,348,659,358,645,367,638,378,626,388,620,399,610,410",
			smap:[{i:50,c_en:"132,6,460,54",c_ar:"148,0,424,54",p:"father"},{i:91,c_en:"323,101,492,150",c_ar:"324,97,449,143"},{i:92,c_en:"323,371,515,420",c_ar:"324,366,464,414"}] },
/*054*/{ eng:"Abdullah Khalil Ibrahim" , ar:"عبدالله خليل ابراهيم" , path:"./branches/AbdullahKhalilIbrahim.png" , shape:"poly" , 
			coords:"343,1096,352,1083,366,1075,391,1069,409,1066,402,1050,395,1035,388,1021,374,1013,360,1017,346,1026,336,1038,329,1054,329,1087",
			smap:[{i:23,c_en:"162,6,320,54",c_ar:"178,0,310,54",p:"father"},{i:55,c_en:"295,65,466,113",c_ar:"296,62,428,111"},{i:69,c_en:"73,71,205,120",c_ar:"114,70,204,120"}] },
/*055*/{ eng:"Saleh Abdullah Khalil Ibrahim" , ar:"صالح عبدالله خليل ابراهيم" , path:"./branches/SalehAbdullahKhalilIbrahim.png" , shape:"poly" , 
			coords:"377,1005,367,1010,352,1014,343,1019,331,1031,326,1041,314,1044,284,1021,256,996,237,974,244,967,262,958,286,951,305,947,318,953,345,969,357,981,367,985,374,991",
			smap:[{i:54,c_en:"186,2,388,49",c_ar:"211,0,354,45",p:"father"},{i:58,c_en:"120,232,237,268",c_ar:"235,227,149,266"},{i:57,c_en:"95,366,258,403",c_ar:"235,359,130,399"},
				{i:61,c_en:"323,562,483,608",c_ar:"323,557,443,601"},{i:59,c_en:"86,86,258,126",c_ar:"233,87,126,124"},{i:62,c_en:"322,336,454,373",c_ar:"323,328,413,368"},
				{i:56,c_en:"103,505,261,545",c_ar:"237,497,132,540"},{i:67,c_en:"325,54,640,97",c_ar:"323,51,538,93"}] },
/*056*/{ eng:"Said Saleh Abdullah Khalil" , ar:"سعيد صالح عبدالله خليل" , path:"./branches/SaidSalehAbdullahKhalil.png" , shape:"poly" , 
			coords:"222,952,210,937,200,925,190,909,183,886,186,861,186,836,187,817,186,789,182,770,190,775,194,786,200,824,201,850,199,862,196,875,200,899,208,920",
			smap:[{i:55,c_en:"165,51,3,2",c_ar:"1,0,112,48",p:"father"},{i:132,c_en:"74,59,184,109",c_ar:"75,60,176,110"},{i:133,c_en:"75,270,188,321",c_ar:"75,269,179,317"},
				{i:134,c_en:"74,406,185,456",c_ar:"75,401,183,453"}] },
/*057*/{ eng:"Nassif Saleh Abdullah Khalil" , ar:"ناصيف صالح عبدالله خليل" , path:"./branches/NassifSalehAbdullahKhalil.png" , shape:"poly" , 
			coords:"287,923,290,898,296,867,294,850,301,828,308,814,312,808,319,797,322,783,332,788,321,832,307,870,303,881,298,895,296,912,296,925,293,932",
			smap:[{i:55,c_en:"204,10,389,65",c_ar:"229,9,361,61",p:"father"},{i:135,c_en:"335,71,452,121",c_ar:"334,72,451,116"},{i:136,c_en:"115,76,261,123",c_ar:"127,78,248,123"}] },
/*058*/{ eng:"Nicola Saleh Abdullah Khalil" , ar:"نقولا صالح عبدالله خليل" , path:"./branches/NicolaSalehAbdullahKhalil.png" , shape:"poly" , 
			coords:"297,934,303,902,307,878,315,856,325,844,340,825,352,821,357,826,346,837,335,850,326,873,318,891,314,906,312,920,312,934,312,943",
			smap:[{i:55,c_en:"0,0,139,52",c_ar:"0,0,111,48",p:"father"},{i:137,c_en:"72,140,246,188",c_ar:"72,135,226,183"}] },
/*059*/{ eng:"Najib Saleh Abdullah Khalil" , ar:"نجيب صالح عبدالله خليل" , path:"./branches/NajibSalehAbdullahKhalil.png" , shape:"poly" , 
			coords:"249,924,253,891,255,870,248,851,249,837,260,816,262,780,262,745,265,698,267,681,279,666,277,694,276,714,274,747,273,775,270,799,273,826,273,843,273,861,270,878,269,888,269,906,267,914,265,930,251,933",
			smap:[{i:55,c_en:"130,0,315,64",c_ar:"170,0,290,64",p:"father"},{i:60,c_en:"252,70,585,122",c_ar:"252,70,492,122"}] },
/*060*/{ eng:"George Najib Saleh Abdullah" , ar:"جورج نجيب صالح عبدالله" , path:"./branches/GeorgeNajibSalehAbdullah.png" , shape:"poly" , 
			coords:"269,666,284,654,286,639,293,625,296,608,296,588,298,573,293,555,297,534,291,524,288,535,288,543,290,564,290,581,283,588,281,600,276,608,276,625,276,639",
			smap:[{i:59,c_en:"92,5,429,58",c_ar:"71,5,336,61",p:"father"},{i:138,c_en:"226,101,364,154",c_ar:"226,107,340,153"},{i:139,c_en:"227,238,384,289",c_ar:"226,240,356,288"}] },
/*061*/{ eng:"Raji Saleh Abdullah Khalil" , ar:"راجي صالح عبدالله خليل" , path:"./branches/RajiSalehAbdullahKhalil.png" , shape:"poly" , 
			coords:"273,929,274,899,279,878,281,850,281,829,283,807,288,794,296,759,297,739,307,712,310,727,303,766,300,791,300,812,296,839,290,867,287,889,284,906,286,929",
			smap:[{i:55,c_en:"270,5,429,65",c_ar:"280,5,419,65",p:"father"},{i:140,c_en:"396,186,584,239",c_ar:"387,186,534,234"},{i:141,c_en:"140,88,284,145",c_ar:"160,88,274,145"}] },
/*062*/{ eng:"Radi Saleh Abdullah Khalil" , ar:"راضي صالح عبدالله خليل" , path:"./branches/RadiSalehAbdullahKhalil.png" , shape:"poly" , 	
			coords:"222,938,214,917,211,885,211,866,208,851,211,831,220,813,221,784,221,746,218,695,215,623,211,600,224,598,227,618,231,642,231,688,235,737,234,803,239,833,237,854,231,869,228,890,228,913,225,923",
			smap:[{i:55,c_en:"238,8,396,54",c_ar:"341,42,232,0",p:"father"},{i:142,c_en:"139,333,282,371",c_ar:"253,315,145,364"},{i:143,c_en:"129,470,306,511",c_ar:"251,455,105,500"},
				{i:63,c_en:"364,63,548,106",c_ar:"338,44,466,94"},{i:64,c_en:"364,277,547,315",c_ar:"337,265,471,307"},{i:66,c_en:"131,68,300,109",c_ar:"116,50,249,98"},
				{i:65,c_en:"366,501,685,540",c_ar:"337,487,592,529"}] },
/*063*/{ eng:"Salem Radi Saleh Abdullah" , ar:"سالم راضي صالح عبدالله" , path:"./branches/SalemRadiSalehAbdullah.png" , shape:"poly" , 
			coords:"213,574,200,536,206,517,218,501,224,487,228,475,242,465,253,456,270,432,279,428,272,440,263,448,252,468,244,483,242,497,231,508,218,517,211,529,207,546",
			smap:[{i:62,c_en:"308,27,495,79",c_ar:"238,7,365,59",p:"father"},{i:144,c_en:"386,114,568,154",c_ar:"336,94,460,134"},{i:145,c_en:"153,97,325,147",c_ar:"123,77,250,127"}] },
/*064*/{ eng:"Mikhaeel Radi Saleh Abdullah" , ar:"مخائيل راضي صالح عبدالله" , path:"./branches/MikhaeelRadiSalehAbdullah.png" , shape:"poly" , 
			coords:"201,552,194,521,194,493,203,463,210,435,217,409,224,393,229,381,232,368,217,383,211,397,203,416,190,423,182,442,186,456,192,476,187,501,192,535",
			smap:[{i:62,c_en:"228,5,425,61",c_ar:"178,7,305,59",p:"father"},{i:146,c_en:"313,68,475,118",c_ar:"280,64,425,114"},{i:147,c_en:"80,153,240,200",c_ar:"73,157,185,200"}] },
/*065*/{ eng:"Maarouf Radi Saleh Abdullah" , ar:"معروف راضي صالح عبدالله" , path:"./branches/MaaroufRadiSalehAbdullah.png" , shape:"poly" , 
			coords:"203,572,189,559,178,552,168,557,158,563,145,569,127,569,126,557,135,548,142,538,161,538,172,539,182,541",
			smap:[{i:62,c_en:"151,5,484,55",c_ar:"100,6,369,57",p:"father"},{i:148,c_en:"308,141,510,182",c_ar:"252,138,390,178"},{i:149,c_en:"308,290,575,331",c_ar:"253,289,472,336"}] },
/*066*/{ eng:"Simaan Radi Saleh Abdullah" , ar:"سمعان راضي صالح عبدالله" , path:"./branches/SimaanRadiSalehAbdullah.png" , shape:"poly" , 
			coords:"199,555,187,528,180,504,176,484,171,470,159,455,155,465,162,484,162,496,165,506,165,520,176,532,185,539",
			smap:[{i:62,c_en:"251,10,424,63",c_ar:"215,10,348,63",p:"father"},{i:150,c_en:"333,111,477,157",c_ar:"307,106,427,157"}] },
/*067*/{ eng:"Shibly Saleh Abdullah Khalil" , ar:"شبلي صالح عبدالله خليل" , path:"./branches/ShiblySalehAbdullahKhalil.png" , shape:"poly" , 
			coords:"225,958,211,941,197,928,187,907,179,889,166,878,155,864,145,847,141,814,144,795,135,795,131,813,133,830,134,847,140,862,147,880,158,900,169,914,189,939,208,952,213,960",
			smap:[{i:55,c_en:"141,19,467,73",c_ar:"117,23,332,73",p:"father"},{i:68,c_en:"316,134,506,183",c_ar:"264,129,411,170"},{i:151,c_en:"229,116,87,160",c_ar:"176,119,76,160"},
				{i:152,c_en:"307,338,443,389",c_ar:"256,341,358,392"}]  },
/*068*/{ eng:"Saleh Shibly Saleh Abdullah" , ar:"صالح شبلي صالح عبدالله" , path:"./branches/SalehShiblySalehAbdullah.png" , shape:"poly" , 
			coords:"133,788,142,785,137,764,131,748,135,737,130,725,123,718,120,706,114,688,112,668,92,660,79,666,99,671,102,685,106,699,107,709,106,719,107,734,112,748,120,751,126,764",
			smap:[{i:67,c_en:"181,50,0,0",c_ar:"142,50,0,1",p:"father"},{i:153,c_en:"70,58,216,107",c_ar:"70,59,187,105"},{i:154,c_en:"69,270,213,320",c_ar:"69,266,173,316"}]  },
/*069*/{ eng:"Jeryes Abdullah Khalil Ibrahim" , ar:"جريس عبدالله خليل ابراهيم" , path:"./branches/JeryesAbdullahKhalilIbrahim.png" , shape:"poly" , 
			coords:"321,1078,304,1075,290,1061,272,1052,245,1035,211,1020,215,990,252,1009,279,1027,297,1040,318,1047,325,1052,325,1064",
			smap:[{i:54,c_en:"205,25,349,77",c_ar:"207,30,301,76",p:"father"},{i:70,c_en:"64,204,231,250",c_ar:"214,200,95,250"},{i:71,c_en:"292,160,493,213",c_ar:"279,159,412,212"}]  },
/*070*/{ eng:"Fadoul Jeryes Abdullah Khalil" , ar:"فضول جريس عبدالله خليل" , path:"./branches/FadoulJeryesAbdullahKhalil.png" , shape:"poly" , 
			coords:"201,998,182,994,169,987,154,976,144,975,119,972,99,987,79,996,88,997,107,1000,130,1001,149,1003,169,1001,183,1008,193,1007",
			smap:[{i:69,c_en:"255,6,432,57",c_ar:"274,3,418,53",p:"father"},{i:129,c_en:"386,63,529,101",c_ar:"386,61,510,106"},{i:130,c_en:"164,76,278,132",c_ar:"179,79,280,128"},
				{i:131,c_en:"386,219,543,257",c_ar:"384,220,488,264"}]  },
/*071*/{ eng:"Fadeel Jeryes Abdullah Khalil" , ar:"فضيل جريس عبدالله خليل" , path:"./branches/FadeelJeryesAbdullahKhalil.png" , shape:"poly" , 
			coords:"207,998,208,990,197,984,182,976,162,956,145,948,127,945,106,949,93,956,113,962,130,965,151,973,162,975,175,983,186,990,196,993",
			smap:[{i:69,c_en:"0,0,200,51",c_ar:"127,46,0,1",p:"father"},{i:127,c_en:"73,96,210,147",c_ar:"73,98,185,145"},{i:128,c_en:"73,269,195,321",c_ar:"74,271,185,316"}]  },
			
// * * * * * * * * * * * * * * *  // Leaves section / circles // * * * * * * * * * * * * * * *  //
				//Asaad Sleiman subsection 
					//Iskandar
/*072*/{ eng:"Mundher Iskandar Asaad Sleiman" , ar:"منذر اسكندر أسعد سليمان" , path:"./leaves/MunderIskandarAsaadSleiman.png" , shape:"circle" , coords:"465,436,15" , 
			smap:[{i:41,c_en:"35,0,170,29",c_ar:"30,3,120,28",p:"father"}]  },
					//Mikhaeel
/*073*/{ eng:"Wadie Mikhaeel Asaad Sleiman" , ar:"وديع مخائيل أسعد سليمان" , path:"./leaves/WadieMikhaeelAsaadSleiman.png" , shape:"circle" , coords:"633,520,16" , 
			smap:[{i:42,c_en:"0,0,200,54",c_ar:"0,0,125,54",p:"father"}]},
/*074*/{ eng:"Michel Keysar Mikhaeel Asaad" , ar:"ميشيل قيصر مخائيل أسعد" , path:"./leaves/MichelKeysarMikhaeelAsaad.png" , shape:"circle" , coords:"781,493,13" , 
			smap:[{i:43,c_en:"0,0,150,54",c_ar:"0,0,100,50",p:"father"}]},
/*075*/{ eng:"Nayef Keysar Mikhaeel Asaad" , ar:"نايف قيصر مخائيل أسعد" , path:"./leaves/NayefKeysarMikhaeelAsaad.png" , shape:"circle" , coords:"793,470,15" , 
			smap:[{i:43,c_en:"0,0,200,54",c_ar:"0,0,150,50",p:"father"}]},
/*076*/{ eng:"Elias Keysar Mikhaeel Asaad" , ar:"الياس قيصر مخائيل أسعد" , path:"./leaves/EliasKeysarMikhaeelAsaad.png" , shape:"circle" , coords:"758,461,14" , 
			smap:[{i:43,c_en:"0,0,150,54",c_ar:"0,0,125,50",p:"father"}]},
/*077*/{ eng:"Sami Keysar Mikhaeel Asaad" , ar:"سامي قيصر مخائيل أسعد" , path:"./leaves/SamiKeysarMikhaeelAsaad.png" , shape:"circle" , coords:"738,490,13" , 
			smap:[{i:43,c_en:"0,0,175,54",c_ar:"0,0,130,50",p:"father"}]},
/*078*/{ eng:"Maurice Keysar Mikhaeel Asaad" , ar:"موريس قيصر مخائيل أسعد" , path:"./leaves/MauriceKeysarMikhaeelAsaad.png" , shape:"circle" , coords:"760,484,13" , 
			smap:[{i:43,c_en:"0,0,180,54",c_ar:"0,0,130,50",p:"father"}]},
/*079*/{ eng:"Anis Keysar Mikhaeel Asaad" , ar:"أنيس قيصر مخائيل أسعد" , path:"./leaves/AnisKeysarMikhaeelAsaad.png" , shape:"circle" , coords:"717,492,14" , 
			smap:[{i:43,c_en:"0,0,180,54",c_ar:"0,0,120,50",p:"father"}]},
/*080*/{ eng:"Albert Asaad Mikhaeel Asaad" , ar:"ألبير أسعد مخائيل أسعد" , path:"./leaves/AlbertAsaadMikhaeelAsaad.png" , shape:"circle" , coords:"751,424,13" , 
			smap:[{i:44,c_en:"0,0,180,54",c_ar:"0,0,130,50",p:"father"}]},
/*081*/{ eng:"Asad Wasef Mikhaeel Asaad" , ar:"أسد واصف مخائيل أسعد" , path:"./leaves/AsadWasefMikhaeelAsaad.png" , shape:"circle" , coords:"710,397,14" , 
			smap:[{i:45,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
					//Sleiman
/*082*/{ eng:"Anton Sleiman Asaad Sleiman" , ar:"أنطون سليمان أسعد سليمان" , path:"./leaves/AntonSleimanAsaadSleiman.png" , shape:"circle" , coords:"564,412,15" , 
			smap:[{i:50,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*083*/{ eng:"Aziz Sleiman Asaad Sleiman" , ar:"عزيز سليمان أسعد سليمان" , path:"./leaves/AzizSleimanAsaadSleiman.png" , shape:"circle" , coords:"557,436,12" , 
			smap:[{i:50,c_en:"0,0,160,54",c_ar:"0,0,100,44",p:"father"}]},
/*084*/{ eng:"Jamal Sleiman Asaad Sleiman" , ar:"جمال سليمان أسعد سليمان" , path:"./leaves/JamalSleimanAsaadSleiman.png" , shape:"circle" , coords:"569,391,15" , 
			smap:[{i:50,c_en:"0,0,185,55",c_ar:"0,0,130,44",p:"father"}]},
/*085*/{ eng:"Sleiman Tawfik Sleiman Asaad" , ar:"سليمان توفيق سليمان أسعد" , path:"./leaves/SleimanTawfikSleimanAsaad.png" , shape:"circle" , coords:"627,300,14" , 
			smap:[{i:51,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*086*/{ eng:"Victor Tawfik Sleiman Asaad" , ar:"فيكتور توفيق سليمان أسعد" , path:"./leaves/VictorTawfikSleimanAsaad.png" , shape:"circle" , coords:"604,230,16" , 
			smap:[{i:51,c_en:"0,0,180,55",c_ar:"0,0,128,55",p:"father"}]},
/*087*/{ eng:"Jeryes Tawfik Sleiman Asaad" , ar:"جريس توفيق سليمان أسعد" , path:"./leaves/JeryesTawfikSleimanAsaad.png" , shape:"circle" , coords:"640,279,14" , 
			smap:[{i:51,c_en:"0,0,160,54",c_ar:"0,0,110,44",p:"father"}]},
/*088*/{ eng:"Farid Tawfik Sleiman Asaad" , ar:"فريد توفيق سليمان أسعد" , path:"./leaves/FaridTawfikSleimanAsaad.png" , shape:"circle" , coords:"635,238,17" , 
			smap:[{i:51,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*089*/{ eng:"Nabeeh Tawfik Sleiman Asaad" , ar:"نبيه توفيق سليمان أسعد" , path:"./leaves/NabeehTawfikSleimanAsaad.png" , shape:"circle" , coords:"640,256,14" , 
			smap:[{i:51,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*090*/{ eng:"Wasfi Elias Sleiman Asaad" , ar:"وصفي الياس سليمان أسعد" , path:"./leaves/WasfiEliasSleimanAsaad.png" , shape:"circle" , coords:"651,324,14" , 
			smap:[{i:52,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*091*/{ eng:"Marwan Raja Sleiman Asaad" , ar:"مروان رجا سليمان أسعد" , path:"./leaves/MarwanRajaSleimanAsaad.png" , shape:"circle" , coords:"659,379,15" , 
			smap:[{i:53,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*092*/{ eng:"Munzer Raja Sleiman Asaad" , ar:"منذر رجا سليمان أسعد" , path:"./leaves/MunzerRajaSleimanAsaad.png" , shape:"circle" , coords:"678,366,16" , 
			smap:[{i:53,c_en:"0,0,185,54",c_ar:"0,0,134,44",p:"father"}]},
					//Salim
/*093*/{ eng:"Rashid Salim Asaad Sleiman" , ar:"رشيد سليم أسعد سليمان" , path:"./leaves/RashidSalimAsaadSleiman.png" , shape:"circle" , coords:"554,370,14",
			smap:[{i:46,c_en:"0,0,260,58",c_ar:"0,0,235,58",p:"father"}]},
/*094*/{ eng:"Salim Naeem Salim Asaad" , ar:"سليم نعيم سليم أسعد" , path:"./leaves/SalimNaeemSalimAsaad.png" , shape:"circle" , coords:"505,273,13",
			smap:[{i:47,c_en:"0,0,120,52",c_ar:"0,0,120,44",p:"father"}]},
/*095*/{ eng:"Suheil Naeem Salim Asaad" , ar:"سهيل نعيم سليم أسعد" , path:"./leaves/SuheilNaeemSalimAsaad.png" , shape:"circle" , coords:"496,242,14",
			smap:[{i:47,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*096*/{ eng:"Samir Naeem Salim Asaad" , ar:"سمير نعيم سليم أسعد" , path:"./leaves/SamirNaeemSalimAsaad.png" , shape:"circle" , coords:"467,282,13",
			smap:[{i:47,c_en:"0,0,172,52",c_ar:"0,0,125,49",p:"father"}]},
/*097*/{ eng:"Nabil Elia Salim Asaad" , ar:"نبيل ايليا سليم أسعد" , path:"./leaves/NabilEliaSalimAsaad.png" , shape:"circle" , coords:"560,202,14",
			smap:[{i:48,c_en:"0,0,130,52",c_ar:"0,0,120,44",p:"father"}]},
/*098*/{ eng:"Ramzi Elia Salim Asaad" , ar:"رمزي ايليا سليم أسعد" , path:"./leaves/RamziEliaSalimAsaad.png" , shape:"circle" , coords:"553,231,12",
			smap:[{i:48,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*099*/{ eng:"Mounir Elia Salim Asaad" , ar:"منير ايليا سليم أسعد" , path:"./leaves/MounirEliaSalimAsaad.png" , shape:"circle" , coords:"520,241,13",
			smap:[{i:48,c_en:"0,0,170,52",c_ar:"0,0,130,50",p:"father"}]},
/*100*/{ eng:"Adel Elia Salim Asaad" , ar:"عادل ايليا سليم أسعد" , path:"./leaves/AdelEliaSalimAsaad.png" , shape:"circle" , coords:"520,210,14",
			smap:[{i:48,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
/*101*/{ eng:"Victor George Salim Asaad" , ar:"فيكتور جورج سليم أسعد" , path:"./leaves/VictorGeorgeSalimAsaad.png" , shape:"circle" , coords:"458,346,14",
			smap:[{i:49,c_en:"0,0,140,52",c_ar:"0,0,120,44",p:"father"}]},
/*102*/{ eng:"Fayez George Salim Asaad" , ar:"فايز جورج سليم أسعد" , path:"./leaves/FayezGeorgeSalimAsaad.png" , shape:"circle" , coords:"432,339,13",
			smap:[{i:49,c_en:"0,0,160,54",c_ar:"0,0,120,44",p:"father"}]},
				//Yousef Sleiman subsection
/*103*/{ eng:"Nieman Mineem Yousef Sleiman" , ar:"نعمان منعم يوسف سليمان" , path:"./leaves/NiemanMineemYousefSleiman.png" , shape:"circle" , coords:"439,609,15",
			smap:[{i:36,c_en:"0,0,125,53",c_ar:"0,0,111,51",p:"father"}] },
/*104*/{ eng:"Jean Mineem Yousef Sleiman" , ar:"جان منعم يوسف سليمان" , path:"./leaves/JeanMineemYousefSleiman.png" , shape:"circle" , coords:"475,609,13",
			smap:[{i:36,c_en:"0,0,125,51",c_ar:"0,0,111,51",p:"father"}] },
				//Khalil Nasser subsection
/*105*/{ eng:"Abdou Khalil Abdou Khalil" , ar:"عبده خليل عبده خليل" , path:"./leaves/AbdouKhalilAbdouKhalil.png" , shape:"circle" , coords:"590,585,15",
			smap:[{i:28,c_en:"0,0,120,55",c_ar:"0,0,125,50",p:"father"}] },
/*106*/{ eng:"Antoine Khalil Abdou Khalil" , ar:"أنطوان خليل عبده خليل" , path:"./leaves/AntoineKhalilAbdouKhalil.png" , shape:"circle" , coords:"621,613,14",
			smap:[{i:28,c_en:"0,0,160,52",c_ar:"0,0,125,50",p:"father"}] },
/*107*/{ eng:"Nasser Khalil Abdou Khalil" , ar:"ناصر خليل عبده خليل" , path:"./leaves/NasserKhalilAbdouKhalil.png" , shape:"circle" , coords:"633,591,14",
			smap:[{i:28,c_en:"0,0,160,52",c_ar:"0,0,125,50",p:"father"}] },
/*108*/{ eng:"Majed Moeen Abdou Khalil" , ar:"ماجد معين عبده خليل" , path:"./leaves/MajedMoeenAbdouKhalil.png" , shape:"circle" , coords:"582,617,13",
			smap:[{i:29,c_en:"132,52,0,0",c_ar:"0,0,120,50",p:"father"}] },
				//Hanna Nasser subsection
/*109*/{ eng:"Hanna Ameen Hanna Nasser" , ar:"حنا أمين حنا ناصر" , path:"./leaves/HannaAmeenHannaNasser.png" , shape:"circle" , coords:"647,669,13",
			smap:[{i:31,c_en:"160,0,340,52",c_ar:"160,14,300,60",p:"father"}]},
/*110*/{ eng:"Lotof Ameen Hanna Nasser" , ar:"لطف أمين حنا ناصر" , path:"./leaves/LotofAmeenHannaNasser.png" , shape:"circle" , coords:"620,665,15",
			smap:[{i:31,c_en:"0,0,125,50",c_ar:"0,0,100,45",p:"father"}]},
/*111*/{ eng:"Raja Jameel Hanna Nasser" , ar:"رجا جميل حنا ناصر" , path:"./leaves/RajaJameelHannaNasser.png" , shape:"circle" , coords:"666,718,13",
			smap:[{i:32,c_en:"0,0,150,50",c_ar:"0,0,130,45",p:"father"}]},
				//Yousef Moussa subsection
/*112*/{ eng:"Aziz Tawfik Moussa Yousef" , ar:"عزيز توفيق موسى يوسف" , path:"./leaves/AzizTawfikMoussaYousef.png" , shape:"circle" , coords:"905,904,15",
			smap:[{i:7,c_en:"122,48,1,0",c_ar:"86,43,0,2",p:"father"}]  },
/*113*/{ eng:"Yousef Tawfik Moussa Yousef" , ar:"يوسف توفيق موسى يوسف" , path:"./leaves/YousefTawfikMoussaYousef.png" , shape:"circle" , coords:"874,930,14",
			smap:[{i:7,c_en:"138,50,0,1",c_ar:"124,44,1,1",p:"father"}] },
/*114*/{ eng:"Hanna Tawfik Moussa Yousef" , ar:"حنا توفيق موسى يوسف" , path:"./leaves/HannaTawfikMoussaYousef.png" , shape:"circle" , coords:"880,887,15",
			smap:[{i:7,c_en:"134,47,1,0",c_ar:"135,49,0,0",p:"father"}] },
/*115*/{ eng:"Shafik Elias Moussa Yousef" , ar:"شفيق الياس موسى يوسف" , path:"./leaves/ShafikEliasMoussaYousef.png" , shape:"circle" , coords:"925,801,15",
			smap:[{i:8,c_en:"122,49,0,0",c_ar:"135,50,0,0",p:"father"}] },
				//Dahoud Moussa subsection 
					//Sleiman
/*116*/{ eng:"Adeeb Nimer Elias Sleiman" , ar:"أديب نمر الياس سليمان" , path:"./leaves/AdeebNimerEliasSleiman.png" , shape:"circle" , coords:"869,550,15",
			smap:[{i:12,c_en:"130,50,0,0",c_ar:"110,40,0,1",p:"father"}]  },
/*117*/{ eng:"Elias Nimer Elias Sleiman" , ar:"الياس نمر الياس سليمان" , path:"./leaves/EliasNimerEliasSleiman.png" , shape:"circle" , coords:"869,588,16",
			smap:[{i:12,c_en:"172,50,0,0",c_ar:"125,39,0,2",p:"father"}]  },
/*118*/{ eng:"Abdallah Dahoud Sleiman Dahoud" , ar:"عبدالله داود سليمان داود" , path:"./leaves/AbdallahDahoudSleimanDahoud.png" , shape:"circle" , coords:"876,683,16",
			smap:[{i:14,c_en:"148,50,0,0",c_ar:"121,50,0,0",p:"father"}] },
/*119*/{ eng:"Sleiman Dahoud Sleiman Dahoud" , ar:"سليمان داود سليمان داود" , path:"./leaves/SleimanDahoudSleimanDahoud.png" , shape:"circle" , coords:"894,662,17",
			smap:[{i:14,c_en:"148,50,0,0",c_ar:"121,50,0,0",p:"father"}] },
/*120*/{ eng:"Sami Dahoud Sleiman Dahoud" , ar:"سامي داود سليمان داود" , path:"./leaves/SamiDahoudSleimanDahoud.png" , shape:"circle" , coords:"913,643,14",
			smap:[{i:14,c_en:"170,53,0,0",c_ar:"131,50,0,0",p:"father"}] },
					//Yousef
/*121*/{ eng:"Yousef Salim Yousef Dahoud" , ar:"يوسف سليم يوسف داود" , path:"./leaves/YousefSalimYousefDahoud.png" , shape:"circle" , coords:"781,739,16",
			smap:[{i:17,c_en:"130,49,0,0",c_ar:"90,45,0,0",p:"father"}] },
					//Ibrahim
/*122*/{ eng:"Jameel Jeryes Ibrahim Dahoud" , ar:"جميل جريس ابراهيم داود" , path:"./leaves/JameelJeryesIbrahimDahoud.png" , shape:"circle" , coords:"751,695,14",
			smap:[{i:19,c_en:"134,50,0,0",c_ar:"132,48,0,2",p:"father"}] },
/*123*/{ eng:"Afif Jeryes Ibrahim Dahoud" , ar:"عفيف جريس ابراهيم داود" , path:"./leaves/AfifJeryesIbrahimDahoud.png" , shape:"circle" , coords:"753,672,14",
			smap:[{i:19,c_en:"164,50,0,1",c_ar:"116,40,0,1",p:"father"}] },
					//Iseed
/*124*/{ eng:"Iseed Jarmas Iseed Dahoud" , ar:"اسعيد جرمس اسعيد داود" , path:"./leaves/IseedJarmasIseedDahoud.png" , shape:"circle" , coords:"760,550,17",
			smap:[{i:21,c_en:"178,1,363,53",c_ar:"327,0,190,48",p:"father"}] },
/*125*/{ eng:"Bishara Jarmas Iseed Dahoud" , ar:"بشارة جرمس اسعيد داود" , path:"./leaves/BisharaJarmasIseedDahoud.png" , shape:"circle" , coords:"755,589,14",
			smap:[{i:21,c_en:"265,52,0,1",c_ar:"224,47,0,0",p:"father"}]  },
/*126*/{ eng:"Abdou Jarmas Iseed Dahoud" , ar:"عبده جرمس اسعيد داود" , path:"./leaves/AbdouJarmasIseedDahoud.png" , shape:"circle" , coords:"727,591,14",
			smap:[{i:21,c_en:"204,4,350,55",c_ar:"209,7,341,56",p:"father"}] },
				//Jeryes Abdullah subsection
/*127*/{ eng:"Jeryes Fadeel Jeryes Abdullah" , ar:"جريس فضيل جريس عبدالله" , path:"./leaves/JeryesFadeelJeryesAbdullah.png" , shape:"circle" , coords:"46,952,13",
			smap:[{i:71,c_en:"0,0,150,52",c_ar:"0,0,109,50",p:"father"}] },
/*128*/{ eng:"Tawfik Fadeel Jeryes Abdullah" , ar:"توفيق فضيل جريس عبدالله" , path:"./leaves/TawfikFadeelJeryesAbdullah.png" , shape:"circle" , coords:"62,968,14",
			smap:[{i:71,c_en:"0,0,130,52",c_ar:"0,0,109,50",p:"father"}] },
/*129*/{ eng:"Diab Fadoul Jeryes Abdullah" , ar:"دياب فضول جريس عبدالله" , path:"./leaves/DiabFadoulJeryesAbdullah.png" , shape:"circle" , coords:"47,1039,16",
			smap:[{i:70,c_en:"0,0,150,54",c_ar:"0,0,122,50",p:"father"}] },
/*130*/{ eng:"Afif Fadoul Jeryes Abdullah" , ar:"عفيف فضول جريس عبدالله" , path:"./leaves/AfifFadoulJeryesAbdullah.png" , shape:"circle" , coords:"31,1017,14",
			smap:[{i:70,c_en:"0,0,135,51",c_ar:"0,0,109,50",p:"father"}] },
/*131*/{ eng:"Fawzi Fadoul Jeryes Abdullah" , ar:"فوزي فضول جريس عبدالله" , path:"./leaves/FawziFadoulJeryesAbdullah.png" , shape:"circle" , coords:"61,1009,15",
			smap:[{i:70,c_en:"0,0,160,51",c_ar:"0,0,109,50",p:"father"}] },
				//Saleh Abdullah subsection 
					//Said
/*132*/{ eng:"Joul Said Saleh Abdullah" , ar:"جول سعيد صالح عبدالله" , path:"./leaves/JoulSaidSalehAbdullah.png" , shape:"circle" , coords:"154,744,14",
			smap:[{i:56,c_en:"0,0,130,50",c_ar:"0,0,109,50",p:"father"}] },
/*133*/{ eng:"Elias Said Saleh Abdullah" , ar:"الياس سعيد صالح عبدالله" , path:"./leaves/EliasSaidSalehAbdullah.png" , shape:"circle" , coords:"194,727,15",
			smap:[{i:56,c_en:"0,0,130,50",c_ar:"0,0,109,50",p:"father"}] },
/*134*/{ eng:"Emil Said Saleh Abdullah" , ar:"اميل سعيد صالح عبدالله" , path:"./leaves/EmilSaidSalehAbdullah.png" , shape:"circle" , coords:"155,714,17",
			smap:[{i:56,c_en:"0,0,130,50",c_ar:"0,0,109,50",p:"father"}] },
					//Nassif
/*135*/{ eng:"Zidan Nassif Saleh Abdullah" , ar:"زيدان ناصيف صالح عبدالله" , path:"./leaves/ZidanNassifSalehAbdullah.png" , shape:"circle" , coords:"356,748,18",
			smap:[{i:57,c_en:"0,0,130,50",c_ar:"0,0,109,50",p:"father"}] },
/*136*/{ eng:"Sami Nassif Saleh Abdullah" , ar:"سامي ناصيف صالح عبدالله" , path:"./leaves/SamiNassifSalehAbdullah.png" , shape:"circle" , coords:"345,772,15",
			smap:[{i:57,c_en:"0,0,150,50",c_ar:"0,0,114,50",p:"father"}] },
					//Nicola
/*137*/{ eng:"Arab Nicola Saleh Abdullah" , ar:"عرب نقولا صالح عبدالله" , path:"./leaves/ArabNicolaSalehAbdullah.png" , shape:"circle" , coords:"380,832,16",
			smap:[{i:58,c_en:"0,0,167,53",c_ar:"0,0,125,50",p:"father"}] },
					//Najib
/*138*/{ eng:"Najib George Najib Saleh" , ar:"نجيب جورج نجيب صالح" , path:"./leaves/NajibGeorgeNajibSaleh.png" , shape:"circle" , coords:"322,514,19",
			smap:[{i:60,c_en:"0,0,140,52",c_ar:"0,0,109,50",p:"father"}] },
/*139*/{ eng:"Nabil George Najib Saleh" , ar:"نبيل جورج نجيب صالح" , path:"./leaves/NabilGeorgeNajibSaleh.png" , shape:"circle" , coords:"312,542,15",
			smap:[{i:60,c_en:"0,0,167,50",c_ar:"0,0,125,50",p:"father"}] },
					//Raji
/*140*/{ eng:"Gabi Raji Saleh Abdullah" , ar:"جابي راجي صالح عبدالله" , path:"./leaves/GabiRajiSalehAbdullah.png" , shape:"circle" , coords:"342,684,16",
			smap:[{i:61,c_en:"0,0,175,50",c_ar:"0,0,140,48",p:"father"}] },
/*141*/{ eng:"Fouad Raji Saleh Abdullah" , ar:"فؤاد راجي صالح عبدالله" , path:"./leaves/FouadRajiSalehAbdullah.png" , shape:"circle" , coords:"324,704,14",
			smap:[{i:61,c_en:"0,0,130,52",c_ar:"0,0,109,50",p:"father"}] },
					//Radi
/*142*/{ eng:"Abdallah Radi Saleh Abdullah" , ar:"عبدالله راضي صالح عبدالله" , path:"./leaves/AbdallahRadiSalehAbdullah.png" , shape:"circle" , coords:"259,645,15",
			smap:[{i:62,c_en:"0,0,150,52",c_ar:"0,0,109,50",p:"father"}] },
/*143*/{ eng:"Aziz Radi Saleh Abdullah" , ar:"عزيز راضي صالح عبدالله" , path:"./leaves/AzizRadiSalehAbdullah.png" , shape:"circle" , coords:"253,618,17",
			smap:[{i:62,c_en:"0,0,175,52",c_ar:"0,0,130,50",p:"father"}] },
/*144*/{ eng:"Ruda Salem Radi Saleh" , ar:"رضى سالم راضي صالح" , path:"./leaves/RudaSalemRadiSaleh.png" , shape:"circle" , coords:"272,466,15",
			smap:[{i:63,c_en:"0,0,170,52",c_ar:"0,0,114,48",p:"father"}] },
/*145*/{ eng:"Fawzi Salem Radi Saleh" , ar:"فوزي سالم راضي صالح" , path:"./leaves/FawziSalemRadiSaleh.png" , shape:"circle" , coords:"310,429,15",
			smap:[{i:63,c_en:"0,0,160,52",c_ar:"0,0,120,50",p:"father"}] },
/*146*/{ eng:"Fahed Mikhaeel Radi Saleh" , ar:"فهد مخائيل راضي صالح" , path:"./leaves/FahedMikhaeelRadiSaleh.png" , shape:"circle" , coords:"244,395,16",
			smap:[{i:64,c_en:"0,0,160,52",c_ar:"0,0,135,50",p:"father"}] },
/*147*/{ eng:"Ghassan Mikhaeel Radi Saleh" , ar:"غسان مخائيل راضي صالح" , path:"./leaves/GhassanMikhaeelRadiSaleh.png" , shape:"circle" , coords:"201,393,15",
			smap:[{i:64,c_en:"0,0,150,52",c_ar:"0,0,120,50",p:"father"}] },
/*148*/{ eng:"Hani Maarouf Radi Saleh" , ar:"هاني معروف راضي صالح" , path:"./leaves/HaniMaaroufRadiSaleh.png" , shape:"circle" , coords:"138,600,15",
			smap:[{i:65,c_en:"0,0,200,50",c_ar:"0,0,120,48",p:"father"}] },
/*149*/{ eng:"Raji Maarouf Radi Saleh" , ar:"راجي معروف راضي صالح" , path:"./leaves/RajiMaaroufRadiSaleh.png" , shape:"circle" , coords:"117,620,16",
			smap:[{i:65,c_en:"0,0,275,52",c_ar:"0,0,211,50",p:"father"}] },
/*150*/{ eng:"Suheil Simaan Radi Saleh" , ar:"سهيل سمعان راضي صالح" , path:"./leaves/SuheilSimaanRadiSaleh.png" , shape:"circle" , coords:"149,482,17",
			smap:[{i:66,c_en:"0,0,150,52",c_ar:"0,0,120,50",p:"father"}] },
					//Shibly
/*151*/{ eng:"Bassem Shibly Saleh Abdullah" , ar:"باسم شبلي صالح عبدالله" , path:"./leaves/BassemShiblySalehAbdullah.png" , shape:"circle" , coords:"159,809,14",
			smap:[{i:67,c_en:"0,0,150,52",c_ar:"0,0,120,50",p:"father"}] },
/*152*/{ eng:"Mazzawi Shibly Saleh Abdullah" , ar:"مزاوي شبلي صالح عبدالله" , path:"./leaves/MazzawiShiblySalehAbdullah.png" , shape:"circle" , coords:"131,895,16",
			smap:[{i:67,c_en:"0,0,150,50",c_ar:"0,0,120,50",p:"father"}] },
/*153*/{ eng:"Hanna Saleh Shibly Saleh" , ar:"حنا صالح شبلي صالح" , path:"./leaves/HannaSalehShiblySaleh.png" , shape:"circle" , coords:"85,701,15",
			smap:[{i:68,c_en:"0,0,150,52",c_ar:"0,0,120,50",p:"father"}] },
/*154*/{ eng:"Hani Saleh Shibly Saleh" , ar:"هاني صالح شبلي صالح" , path:"./leaves/HaniSalehShiblySaleh.png" , shape:"circle" , coords:"64,686,16",
			smap:[{i:68,c_en:"0,0,150,52",c_ar:"0,0,120,50",p:"father"}] }
			
// * * * * * * * * * * * * * * *  // 'more' section // * * * * * * * * * * * * * * *  //
			// NOT included in drawing but in alternate tree & modal subtrees: added after drawing's time // to be completed LATER // 
			// for leaves that are not mentioned in drawing but in terminal branches or for 'more' leaves inside the leaves above (descendants)
			
			// basic structure: /*###*/ { eng:"W X Y Z" , ar:"W X Y Z" , path:"./more/WXYZ.png" , smap:[{i:,c_en:"",c_ar:""}, ... ] }
			// should update all items' smaps before 155 when adding 'more' leaves ... so that all are connected // 
			// REMEMBER NOT TO ADD any grandsons or great_grandsons" in smaps to any level <<< only for first few imgs after root ... otherwise, errors WILL happen ! // 
			
				//Asaad Sleiman subsection 
					//Iskandar
					//Mikhaeel
					//Sleiman
					//Salim
				//Yousef Sleiman subsection
				//Khalil Nasser subsection
				//Hanna Nasser subsection
				//Yousef Moussa subsection
				//Dahoud Moussa subsection 
					//Sleiman
					//Yousef
					//Ibrahim
					//Iseed
					//Khalil
				//Jeryes Abdullah subsection
				//Saleh Abdullah subsection 
					//Said
					//Nassif
					//Nicola
					//Najib
					//Raji
					//Radi
					//Shibly
];

// = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = =  = = = = = //

// load - functions section //

const map_element_id = "treeMap";
const SCAN_LIMIT = 154; // no need to scan more, nothing is mapped on main drawing beyond this limit ! // 

var m = document.getElementById(map_element_id);
function load_english_map(){
	var res="",curr;
	for(var i=0; i<=SCAN_LIMIT; i++)
	{
		curr=dataArr[i];
		res+="<area title=\""+curr.eng+' &#13; '+curr.ar+"\" alt=\""+curr.path+"\" shape=\""+curr.shape+"\" coords=\""+curr.coords+"\" href=\"#"+i+"\">";
	}
	m.innerHTML = res;
}
function load_arabic_map(){
	var res="",curr;
	for(var i=0; i<=SCAN_LIMIT; i++)
	{
		curr=dataArr[i];
		res+="<area title=\""+curr.ar+"\" alt=\""+curr.path+"\" shape=\""+curr.shape+"\" coords=\""+curr.coords+"\" href=\"#"+i+"\">";
	}
	m.innerHTML = res;
}

// console.log(location.pathname);

if(location.pathname.indexOf("alt_")==-1)  // no need to load when alternative tree page ('blue') is used 
{
	if(location.pathname.indexOf("_ar.html")!=-1) load_arabic_map();
	else load_english_map();
}